{"config": [{"config": {"input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "trainable": true, "function_type": "lambda", "output_shape": null, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-2935d6d9c430>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 1, "activation": "linear", "nb_filter": 3, "name": "conv0", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_row": 1}, "class_name": "Convolution2D"}, {"config": {"init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 32, "name": "conv1", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 32, "name": "conv2", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 64, "name": "conv3", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 64, "name": "conv4", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 128, "name": "conv5", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "he_normal", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "nb_filter": 128, "name": "conv6", "b_constraint": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "output_dim": 512, "activation": "linear", "input_dim": null, "name": "hidden1", "b_constraint": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "output_dim": 64, "activation": "linear", "input_dim": null, "name": "hidden2", "b_constraint": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "output_dim": 16, "activation": "linear", "input_dim": null, "name": "hidden3", "b_constraint": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"p": 0.5, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "trainable": true, "init": "he_normal", "output_dim": 1, "activation": "linear", "input_dim": null, "name": "output", "b_constraint": null, "bias": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}